[
  [
    {
      "companyName": "Internsathi",
      "jobTitle": "Social Media Handler-ID159",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 10000,
      "maxPrice": 13500,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p>We are seeking a motivated and entrepreneurial-minded Social Media Sales Intern to join our team and assist in leveraging social media platforms to drive sales and revenue growth. This internship offers an exciting opportunity for individuals interested in exploring the intersection of social media marketing and sales. The ideal candidate is passionate about social media, has strong sales acumen, and possesses excellent communication skills.</p><p><br></p><p>Location: Naagpokhari, Naxal</p>",
      "requirements": "<ol><li>Strong interest in social media marketing and sales.</li><li>Excellent communication and interpersonal skills, with the ability to engage and build relationships with customers and prospects.</li><li>Sales-oriented mindset with a track record of meeting or exceeding targets.</li><li>Creative thinking and ability to develop engaging social media content that drives sales and conversions.</li><li>Basic knowledge of social media platforms and familiarity with social media management tools.</li><li>Strong analytical skills, with the ability to interpret data and derive actionable insights.</li><li>Ability to work independently and collaboratively in a fast-paced environment.</li><li>Strong organizational and time management skills, with the ability to prioritize tasks and meet deadlines.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Google Workspace (Docs, Sheets, Slides).</li><li>Availability to work part-time or full-time hours during the internship period.</li></ol>",
      "responsibilities": "<p><br></p><ol><li>Develop and execute social media sales strategies to generate leads, drive conversions, and increase revenue.</li><li>Identify and engage with potential customers and prospects through various social media channels, including LinkedIn, Twitter, Facebook, Instagram, and TikTok.</li><li>Create compelling social media content, including posts, stories, videos, and graphics, to showcase our products/services and highlight key selling points.</li><li>Build and nurture relationships with followers, respond to inquiries, and provide timely and personalized customer support.</li><li>Collaborate with the sales team to align social media efforts with sales objectives and initiatives.</li><li>Monitor social media analytics and track key performance metrics to evaluate the effectiveness of sales campaigns and initiatives.</li><li>Research industry trends, competitor activity, and customer preferences to identify opportunities for sales growth and optimization.</li></ol>",
      "url": "https://internsathi.com/internships/social-media-handler-id159-entrylevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Software Developer -Id115",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 35000,
      "maxPrice": 70000,
      "salaryType": "MONTHLY",
      "experienceLevel": "JUNIOR",
      "description": "<p>Our client is seeking a skilled and enthusiastic Web Developer<strong>&nbsp;</strong>with knowledge of web development to join their team. In this role, you will be responsible for developing and maintaining our e-commerce stores, with a specific focus on the Shopify &amp; Bigcommerce platform. While prior experience with Shopify and bigcommerce is not required, the ideal candidate should have a solid understanding of web development basics and a willingness to learn and excel.</p><p>&nbsp;</p><p>Location - Maitrinagar</p><p><br></p><p>Working hour - 9am -6pm</p><p><br></p><p>Lunch provided</p><p>Good holidays</p>",
      "requirements": "<ul><li>Bachelor's degree in Computer Science, Web Development, or a related field (or equivalent work experience)</li><li>Minimum of 2 years of professional web development experience</li><li>Solid understanding of web development fundamentals, including HTML, CSS, JavaScript and responsive design principles</li><li>Familiarity with Shopify is preferred, but not required. Willingness to learn and master the Shopify platform is essential</li><li>Experience in building and customizing websites using content management systems (CMS)</li><li>Strong problem-solving and troubleshooting skills, with the ability to identify and resolve technical issues efficiently</li><li>Knowledge of web analytics tools, such as Google Analytics, to track website performance and user behavior</li><li>Familiarity with version control systems (e.g., Git) and agile development methodologies</li><li>Strong attention to detail and the ability to work on multiple projects simultaneously while meeting deadlines</li><li>Excellent communication and collaboration skills, with the ability to work effectively in a team environment</li></ul><p>&nbsp;</p><p>This is a full-time position located at our office, where you will receive&nbsp;training and guidance&nbsp;on using Shopify &amp; Bigcommerce effectively. We offer a competitive salary and benefits package, as well as opportunities for professional growth and advancement in a fast-paced and innovative environment.</p><p>If you are a motivated web developer with a strong foundation in web development and a passion for e-commerce, we encourage you to apply. Join our team and expand your skills by learning and leveraging the Shopify &amp; Bigcommerce platform to create exceptional online experiences for our customers.</p><p><br></p><p>Note: Candidates with experience in any Frontend or Backend, programming languages such as PHP, JavaScript, HTML CSS,&nbsp;or others can apply.</p>",
      "responsibilities": "<ul><li>Develop and maintain e-commerce websites, with a primary focus on the Shopify platform, ensuring high-quality and visually appealing user interfaces</li><li>Collaborate with cross-functional teams, including designers, marketers, and project managers, to implement website changes, updates, and new features</li><li>Customize and configure Shopify &amp; Bigcommerce themes, templates, and plugins to meet specific project requirements and business needs</li><li>Ensure websites are optimized for performance, responsiveness, and SEO best practices</li><li>Troubleshoot and resolve any front-end and back-end issues that arise, including compatibility and functionality problems</li><li>Perform regular website maintenance tasks, such as monitoring site performance, managing content updates, and resolving technical glitches or bugs</li><li>Stay up-to-date with industry trends, best practices, and new technologies related to web development, PHP, and e-commerce</li><li>Collaborate with the team to brainstorm and propose innovative ideas to improve user experience, conversion rates, and overall website performance</li><li>Provide technical guidance and support to junior developers or team members as needed</li><li>Conduct thorough testing and quality assurance to ensure the website's functionality and compatibility across different browsers and devices</li></ul><p><br></p>",
      "url": "https://internsathi.com/internships/software-developer-id115-juniorlevel-fulltime-onsite"
    },
    {
      "companyName": "Padshala Incorporation Pvt Ltd",
      "jobTitle": "Data Entry Intern with Photoshop Skills",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 5000,
      "maxPrice": 7000,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p><span style=\"color: rgb(13, 13, 13);\">As a Data Entry Intern at Padshala Incorporation Pvt.  Ltd, you will play a crucial role in maintaining and updating our databases. Additionally, your basic Photoshop skills will be utilized to assist with simple image editing tasks. This is a great opportunity for someone looking to gain experience in a professional setting while developing valuable skills.</span></p>",
      "requirements": "<p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Current enrollment in a +2, college / University program or recent graduate. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficiency in English typing. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficiency in Microsoft Office Suit. (Word, Excel, PowerPoint). </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Basic knowledge of Adobe Photoshop </span>(experience with cropping, resizing, and simple adjustments).</p>",
      "responsibilities": "<p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accurately input and update data in our databases. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Verify and correct data where necessary. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perform regular data backups. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assist in Organizing and maintaining digital files. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Use Photoshop to perform basic image editing tasks, such as cropping, resizing and adjusting images for quality.</span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Collaborate with team members to ensure data integrity and consistency. </span></p><p><span style=\"color: rgb(13, 13, 13);\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other administrative tasks as needed.&nbsp;</span></p>",
      "url": "https://internsathi.com/internships/data-entry-intern-with-photoshop-skills-entrylevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Video Editor-ID156",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 20000,
      "maxPrice": 25000,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p>We are seeking a creative and skilled Video Editor &amp; Designer to join our client's team. As an integral part of our marketing department, you will be responsible for producing high-quality video content for their e-commerce platform. This role offers a competitive salary and flexible working hours from 10 am to 5 pm.</p><p><br></p><p>Location: Sifal,Chabel</p>",
      "requirements": "<ul><li>Proficient in Premiere Pro and After Effects.</li><li>Basic designing skills.</li><li>Experience in camera handling and shooting (preferred).</li><li>Ability to work independently and in a team.</li><li>Strong attention to detail and creativity.</li><li>Excellent time management and organizational skills.</li><li>A portfolio showcasing previous video editing and design work is highly desirable.</li></ul><p><br></p>",
      "responsibilities": "<ul><li>Edit and enhance video content using Premiere Pro and After Effects.</li><li>Create visually appealing graphics and animations for videos.</li><li>Handle camera equipment to capture high-quality product shots and visual content.</li><li>Assist in shooting video content as needed.</li><li>Tailor video content to drive engagement and sales on the e-commerce platform.</li><li>Collaborate with the marketing team to brainstorm ideas and execute projects.</li></ul><p><br></p>",
      "url": "https://internsathi.com/internships/video-editor-id156-entrylevel-fulltime-onsite"
    },
    {
      "companyName": "Navya Advisors Limited",
      "jobTitle": "Sales Executive (Intern)",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 5500,
      "maxPrice": 5500,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p class=\"ql-align-justify\">The intern will be responsible for gaining a comprehensive understanding of the company's overall concept, including its brand, customers, product goals, and all other aspects of service. They will work closely with their supervisor to fulfill assigned tasks and responsibilities, attend meetings (both in-house and outbound), take minutes, and represent the company as needed. The intern will rotate through various divisions of responsibility, providing ideas to help grow and improve the business. </p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Additionally, they will conduct market research at the supervisor's request, manage databases, input information, data, and records, cold calling and gather documentation on the company's position in the industry. Directly engaging with customers, clients and/or partners to provide requested service/s and fulfill sales target as per daily/monthly targets will also be part of their duties. Furthermore, the intern will be responsible for weekly reporting and monthly presentations on updates, as well as updating and posting supervised social media content, and responding to web correspondence, social media posts, and emails.</p>",
      "requirements": "<p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Currently enrolled in a relevant undergraduate or graduate program.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Strong communication and interpersonal skills.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to work well both independently and as part of a team.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Detail-oriented with excellent organizational skills.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficiency in Microsoft Office Suite and social media platforms.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Eagerness to learn and contribute innovative ideas.</p>",
      "responsibilities": "<p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Understand the overall concept of the company, including its brand, customers, product goals, and all other aspects of service.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fulfill tasks set out by supervisor/s.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Attend in-house and outbound meetings, take minutes, and represent the company.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rotate through divisions of responsibility and provide ideas to grow and improve the business.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perform market research and cold calls at supervisor's request.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Manage databases and input information, data, and records.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Research and gather documentation on company position in the industry.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Engage with customers, clients and partners to provide service and/or sales as per daily/monthly targets.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Provide weekly reporting and monthly presentations on updates.</p><p class=\"ql-align-justify\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Update and post supervised social media content; respond to web correspondence, social media posts, and emails.</p>",
      "url": "https://internsathi.com/internships/sales-executive-intern-entrylevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Graphics Designer & YouTube Thumbnail Creator/Videoeditor-  ID79",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 30000,
      "maxPrice": 45000,
      "salaryType": "MONTHLY",
      "experienceLevel": "MID",
      "description": "<p>Our client is seeking a talented Junior-Level Graphics designer with photography skills to join their team.</p><p>Are you a creative genius with a minimum of 1 year of experience in graphic design, YouTube thumbnail creation, and photography? Do you possess advanced skills in Photoshop and Illustrator? We are seeking individuals who are not only proficient in these software but also have a keen understanding of gadgets and the tech review industry.</p><p>The recruitment process is managed by the TalentSathi team (Sister Venture of InternSathi for recruitment), ensuring a thorough and fair selection process.</p><p>Location: Mid Baneshwor, Kathmandu</p><p><br></p>",
      "requirements": "<p><br></p><ol><li>Minimum of 1 year of experience in graphic design, YouTube thumbnail creation, and photography.</li><li>Proficiency in Adobe Photoshop and Illustrator is a must.</li><li>A deep understanding of gadgets and the tech review industry, with a passion for staying updated on the latest trends and innovations.</li><li>Excellent communication skills and the ability to collaborate effectively with team members.</li><li>Strong attention to detail and a commitment to delivering high-quality work within deadlines.</li><li>A portfolio showcasing your previous design and photography work, with an emphasis on tech-related projects if available.</li></ol><p><br></p>",
      "responsibilities": "<p><br></p><ol><li>Designing captivating YouTube thumbnails that effectively represent the content of our videos and attract viewers.</li><li>Creating visually stunning graphics for various digital platforms, including social media channels and websites.</li><li>Collaborating with our content creators to understand their vision and translate it into compelling visual elements.</li><li>Staying up-to-date with the latest design trends, especially in the tech and gadget space, to ensure our designs are fresh and relevant.</li><li>Conducting photoshoots to capture high-quality images of gadgets and tech products for use in our content and promotional materials.</li><li>Editing and retouching photos to enhance their visual appeal and ensure they align with our brand aesthetics.</li><li>Contributing creative ideas and concepts to brainstorming sessions to continually improve our visual content.</li></ol><p><br></p>",
      "url": "https://internsathi.com/internships/graphics-designer-and-youtube-thumbnail-creatorvideoeditor-id79-midlevel-fulltime-onsite"
    },
    {
      "companyName": "Internsathi",
      "jobTitle": "SEO content writer intern- ID78",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 10000,
      "maxPrice": 15000,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p>We are looking for a motivated and detail-oriented SEO Content Writer Intern to assist our content team in creating compelling and search engine optimized content. The successful candidate will have the opportunity to work on a variety of projects, gaining hands-on experience and mentorship from experienced professionals in the field. This internship will provide valuable insight into content creation for digital platforms and an opportunity to contribute to our company's growth.</p><p><br></p><p>Location: Old Baneshwor, Kathmandu</p>",
      "requirements": "<ul><li>Currently enrolled in or recent graduate of a relevant degree program in English, journalism, communications, marketing, or a related field.</li><li>Strong writing skills with a keen attention to grammar, spelling, and punctuation.</li><li>Basic understanding of SEO principles and best practices.</li><li>Ability to conduct keyword research and use SEO tools effectively.</li><li>Creative thinking and ability to generate original content ideas.</li><li>Excellent research skills and ability to synthesize information from various sources.</li><li>Strong organizational skills and ability to manage multiple tasks and deadlines.</li><li>Proficiency in Microsoft Office suite and familiarity with content management systems</li></ul>",
      "responsibilities": "<ol><li>Conduct keyword research and analysis to identify relevant topics and optimize content for search engines.</li><li>Write engaging and informative content for various digital platforms, including websites, blogs, social media, and email newsletters.</li><li>Collaborate with team members to brainstorm and develop content ideas that resonate with our target audience.</li><li>Optimize content for SEO best practices, including meta tags, headlines, and internal linking.</li><li>Proofread and edit content to ensure clarity, accuracy, and consistency in style and tone.</li><li>Stay up-to-date with industry trends and best practices in SEO and content marketing.</li><li>Assist in monitoring and analyzing the performance of content using analytics tools to inform future strategies.</li><li>Support the content team in various tasks as needed, including content planning, scheduling, and distribution.</li></ol>",
      "url": "https://internsathi.com/internships/seo-content-writer-intern-id78-entrylevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Software Engineer (Vue.js /Typescript) -ID143",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 35000,
      "maxPrice": 70000,
      "salaryType": "MONTHLY",
      "experienceLevel": "JUNIOR",
      "description": "<p>We're seeking a Frontend Engineer with experience in Vue.js to join our team. You'll work collaboratively with our PHP/Laravel developers to enhance and maintain the front end of our Laravel-based application.</p><p>This role involves building and refining Vue.js components, ensuring a seamless user experience, and integrating with our existing backend. We're looking for someone who is passionate about creating intuitive interfaces and who can effectively collaborate with both backend and design teams.</p><p>&nbsp;</p><p>Location: Yala Road, Kumaripati, Lalitpur</p>",
      "requirements": "<p><br></p><p>- 1-2 years of Experience in the related field</p><p>- Familiarity with testing frameworks like Jest or Vue Testing Library.</p><p>- Experience with TypeScript for enhanced code maintainability and type safety.</p><p><br></p><p>Benefits:</p><ol><li>5 days work</li><li>Festival Bonus</li><li>Open work culture</li><li>Access to online learning</li><li>Develop global skills</li><li>Team building activities</li></ol><p>&nbsp;</p><p>Apply: You can send your resume at career@talentsathi.com.</p>",
      "responsibilities": "<p><br></p><ul><li>Work closely with backend developers to understand the data structures and API endpoints.</li><li>Focus on efficient coding practices to deliver features and enhancements quickly.</li><li>Rapidly translate design mockups and wireframes into functional React components.</li><li>Collaborate with designers and product managers to understand project goals and UI/UX requirements.</li><li>Communicate effectively with designers, product managers, and other stakeholders to gather requirements and clarify project goals.</li></ul>",
      "url": "https://internsathi.com/internships/software-engineer-vuejs-typescript-id143-juniorlevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Software Developer (React Native/Typescript)- ID146",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 30000,
      "maxPrice": 70000,
      "salaryType": "MONTHLY",
      "experienceLevel": "JUNIOR",
      "description": "<p>We're seeking a highly motivated React Native engineer to play a pivotal role in the development of our mobile application. You'll work closely with cross-functional teams to build and maintain our app, taking ownership of both frontend and backend aspects.</p><p><br></p><p>This role requires a strong understanding of React Native for creating seamless user interfaces, as well as the ability to develop and manage the supporting backend infrastructure. We're looking for someone who is a strong communicator, eager to learn, and thrives in a collaborative environment.</p><p><br></p><p>Location: Yala Road, Kumaripati, Lalitpur</p>",
      "requirements": "<p>Requirements:</p><ul><li>Experience with TypeScript for enhanced code maintainability and type safety.</li><li>1-2 years of Experience in related field</li><li>Familiarity with testing frameworks like Jest or React Testing Library.</li></ul><p><br></p><p>Benefits:</p><ul><li>5 days work</li><li>Festival Bonus</li><li>Open work culture</li><li>Access to online learning</li><li>Develop global skills</li><li>Team building activities</li></ul><p><br></p><p>Apply: You can send your resume at career@talentsathi.com.</p>",
      "responsibilities": "<ul><li>Integrate with third-party libraries and APIs, leveraging existing resources and tools when appropriate</li><li>Implement user interfaces that are visually appealing, intuitive, and responsive across different screen sizes and devices.</li><li>Architect and build the frontend of the mobile application, focusing on performance, usability, and accessibility.</li><li>Collaborate with designers and product teams to translate design concepts into high-quality React Native components and features.</li><li>Design and implement RESTful APIs to handle data requests and communication between the frontend and backend.</li></ul>",
      "url": "https://internsathi.com/internships/software-developer-react-nativetypescript-id146-juniorlevel-fulltime-onsite"
    },
    {
      "companyName": "Talentsathi",
      "jobTitle": "Admin Officer/Associate Position -155ID",
      "jobLocation": "ONSITE",
      "employmentType": "FULL_TIME",
      "minPrice": 20000,
      "maxPrice": 23000,
      "salaryType": "MONTHLY",
      "experienceLevel": "ENTRY",
      "description": "<p>As an Associate, you will play a crucial role in supporting the overall operations of the company. You will work closely with the Manager and other team members to ensure the seamless execution of projects. This role requires a combination of organizational skills, communication abilities, and a proactive mindset to navigate the complexities of international product sourcing.</p><p><br></p><p>&nbsp;</p><p>The recruitment process is managed by the TalentSathi team (Sister Venture of InternSathi for recruitment), ensuring a thorough and fair selection process.</p><p><br></p><p>&nbsp;Location: Balwatar, Kathmandu</p><p>Working hours: 9am - 5pm</p>",
      "requirements": "<ul><li>Bachelor's degree in Business, Supply Chain Management, or a related field.</li><li>Strong communication skills, both written and verbal, in English.</li><li>Proficient in Microsoft Office Suite and other relevant software tools.</li><li>Excellent organizational and multitasking abilities.</li><li>Knowledge of international trade regulations and logistics is a plus</li></ul>",
      "responsibilities": "<p>1. Executive Support:</p><p>● Manage the CEO's schedule, including meetings, appointments, and travel arrangements.</p><p>● Prepare and review documents, reports, and presentations for the CEO.</p><p>● Handle confidential information with discretion and professionalism.</p><p>● Serve as the point of contact between the CEO and internal/external stakeholders.</p><p><br></p><p>2. Communication Management:</p><p>● Draft and manage correspondence on behalf of the CEO.</p><p>● Facilitate effective communication within the organization and with external partners.</p><p>● Coordinate and prepare for executive meetings, including taking minutes and following up on action items.</p><p><br></p><p>3. Strategic Assistance:</p><p>● Assist in the development and implementation of strategic</p><p>initiatives.</p><p>● Conduct research and provide insights on market trends,</p><p>competitors, and potential business opportunities.</p><p>● Help in the preparation and analysis</p><p>Project Management:</p><p>● Oversee and manage special projects as directed by the CEO.</p><p>● Ensure projects are on track, deadlines are met, and objectives are achieved.</p><p>● Coordinate with different departments to gather necessary information and resources for projects.</p><p><br></p><p>4. Operational Support:</p><p>● Improve operational processes and procedures to enhance efficiency and productivity.</p><p>● Assist in budgeting, financial reporting, and resource allocation.</p><p>● Monitor key performance indicators (KPIs) and provide regular updates to the CEO.</p><p><br></p><p>5. Relationship Management:</p><p>● Build and maintain relationships with key clients, suppliers, and business partners.</p><p>● Represent the CEO in meetings and events when necessary.</p><p>● Facilitate networking opportunities for the CEO and the organization.</p><p><br></p><p>6. Problem Solving:</p><p>● Identify issues and challenges within the organization and propose solutions.</p><p>● Act as a sounding board for the CEO on various business matters.</p><p>● Address and resolve any administrative or operational problems promptly.</p><p><br></p><p>7. Confidentiality and Discretion:</p><ul><li>Maintain the highest level of confidentiality and integrity in handling sensitive company information.</li><li>Ensure compliance with company policies and procedures, as well as relevant legal regulations.</li><li>By efficiently managing these responsibilities, an assistant to the CEO can significantly contribute to the company's success, particularly in a dynamic and fast-paced industry like sourcing and procurement.</li></ul><p><br></p><p>8. Documentation and Record Keeping</p><p>• Manage and organize sourcing-related documents, including contracts, invoices, and product specifications.</p><p>• Maintain accurate and up-to-date records of supplier information, negotiations, and agreements.</p><p><br></p><p>9. Quality Control</p><p>• Collaborate with the Quality Control team to ensure that products meet specified quality standards.</p><p>• Monitor and report on production progress and address any quality concerns promptly.</p><p><br></p><p>10. Logistics Coordination</p><ul><li>Work with logistics partners to coordinate shipping schedules and track the movement of goods.</li><li>Assist in resolving any shipping or customs-related issues to ensure timely delivery.</li></ul><p><br></p><p>11. Client Support</p><p>• Provide support to clients by addressing inquiries, providing updates, and ensuring a high level of customer satisfaction.</p><p>• Collaborate with the Sales team to understand client requirements and communicate effectively with all stakeholders.</p>",
      "url": "https://internsathi.com/internships/admin-officerassociate-position-155id-entrylevel-fulltime-onsite"
    }
  ],
  []
]